_org_posts/_posts/2021-09-12-STL-binary-search.org
#+HTML: ---
#+HTML: title: STL binary search
#+HTML: tags: STL
#+HTML: toc: true
#+HTML: toc_sticky: true
#+HTML: ---

** STL binary search
- 배열의 시작 위치, 배열의 크기, 찾으려는 값을 순서대로 넣는다.

** 예제 - int 배열
#+BEGIN_SRC cpp
#include <cstdio>
#include <algorithm>
using namespace std;

int a[] = { 1, 5, 8, 9, 6, 7, 3, 4, 2, 0 };
int N;
int main(int argc, char* argv[])
{
    N = sizeof(a) / sizeof(a[0]);
    sort(a, a+N);

    if (binary_search(a, a+N, 8)) {
        printf("8 found\n");
    } else {
        printf("8 not found\n");
    }

    return 0;
}
#+END_SRC

** 예제 - 구조체 배열에서 cmp함수 추가
#+BEGIN_SRC cpp
typedef struct Node {
    int y;
    int x;
} Node;

Node a[2020];

bool comp2(Node p1, Node p2)
{
    return (p1.y < p2.y);
}

int main(int argc, char* argv[])
{
// ...
    int cond1 = binary_search(a, a+N, tmp, comp2);
// ...
#+END_SRC

** 참고자료
- https://www.geeksforgeeks.org/binary-search-algorithms-the-c-standard-template-library-stl/
