_posts/2021-09-12-STL-binary-search.html
---
title: STL binary search
tags: STL
toc: true
toc_sticky: true
---

<div id="outline-container-org34427e3" class="outline-2">
<h2 id="org34427e3">STL binary search</h2>
<div class="outline-text-2" id="text-org34427e3">
<ul class="org-ul">
<li>배열의 시작 위치, 배열의 크기, 찾으려는 값을 순서대로 넣는다.</li>
</ul>
</div>
</div>

<div id="outline-container-org7a30850" class="outline-2">
<h2 id="org7a30850">예제 - int 배열</h2>
<div class="outline-text-2" id="text-org7a30850">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[] = { 1, 5, 8, 9, 6, 7, 3, 4, 2, 0 };
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    N = <span style="color: #729fcf; font-weight: bold;">sizeof</span>(a) / <span style="color: #729fcf; font-weight: bold;">sizeof</span>(a[0]);
    sort(a, a+N);

    <span style="color: #729fcf; font-weight: bold;">if</span> (binary_search(a, a+N, 8)) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"8 found\n"</span>);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        printf(<span style="color: #ad7fa8; font-style: italic;">"8 not found\n"</span>);
    }

    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2168948" class="outline-2">
<h2 id="org2168948">예제 - 구조체 배열에서 cmp함수 추가</h2>
<div class="outline-text-2" id="text-org2168948">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">a</span>[2020];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">comp2</span>(<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.y &lt; p2.y);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
<span style="color: #888a85;">// </span><span style="color: #888a85;">...</span>
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cond1</span> = binary_search(a, a+N, tmp, comp2);
<span style="color: #888a85;">// </span><span style="color: #888a85;">...</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org241bc22" class="outline-2">
<h2 id="org241bc22">참고자료</h2>
<div class="outline-text-2" id="text-org241bc22">
<ul class="org-ul">
<li><a href="https://www.geeksforgeeks.org/binary-search-algorithms-the-c-standard-template-library-stl/">https://www.geeksforgeeks.org/binary-search-algorithms-the-c-standard-template-library-stl/</a></li>
</ul>
</div>
</div>
